README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>A Generic Scheduler</title>

<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/2.5.0/css/reveal.min.css"/>
<link rel="stylesheet" href="http://cdn.jsdelivr.net/reveal.js/2.5.0/css/theme/default.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>A Generic Scheduler</h1>
<h2></h2>
<h2><a href="mailto:"></a></h2>
<h2></h2></section>

<section>
<section id="sec-1" >

<h2>Scheduler Application</h2>
<p>
<a href="http://gensched.herokuapp.com">http://gensched.herokuapp.com</a>
</p>

<p>
Create a generic application for scheduling a service from a user's phone or 
computer via the web (ie. delivery (laundry, beer, groceries)
</p>
</section>


</section>
<section>
<section id="sec-2" >

<h2>Basic concept</h2>
<p>
A user, from the web (via mobile or desktop/laptop), visits the application 
site for a specific service (laundry pickup/delivery), selects a 
service and a date&amp;time. A request for the service/time is emailed
to admin. When approved, a confirmation email is returned and the service is 
planned for the appropriate time on the business side.
</p>
</section>

</section>
<section>
<section id="sec-3" >

<h2>ModelViewControl</h2>
<p>
<a href="http://guides.rubyonrails.org/active_record_basics.html">Users</a> <a href="http://guides.rubyonrails.org/action_controller_overview.html">order and schedule</a> services through a web-based <a href="http://guides.rubyonrails.org/action_view_overview.html">application</a>. 
</p>

<p>
This application displays a calendar and scheduling information along with 
basic operation information. One or more datetimes are selected from a 
controlled array of available times for service to be rendered.
</p>

</section>
<section id="sec-3-1" >

<h3>Model</h3>
<p>
Each <b>page</b> will serve as a node for site structure.
</p>

<p>
A <b>user</b> will have many <b>shifts</b>, associated by id when scheduling requests.
</p>

<p>
<b>Admin</b> users will have access to greenlighting of scheduling requests.
</p>



</section>
<section id="sec-3-1-1" >

<h4>Page</h4>
<ul class="org-ul">
<li><code>[X]</code> generate page scaffolding

<pre class="example">
rails g scaffold Page index
</pre>
</li>
</ul>

<ul class="org-ul"><li class="fragment none">Additional attributes/columns<br/><ul class="org-ul">
<li><code>[&#xa0;]</code> index: string
</li>
</ul>
</li></ul>


</section>
<section id="sec-3-1-2" >

<h4>User</h4>
<ul class="org-ul"><li class="fragment none">Devise<br/><ul class="org-ul">
<li><code>[-]</code> Install <a href="https://github.com/plataformatec/devise">Devise</a>

<ul class="org-ul">
<li><code>[X]</code> add Devise gem to <a href="./Gemfile">Gemfile</a> and bundle

<pre class="example">
gem 'devise'
bundle 
</pre>
</li>

<li><code>[X]</code> run the devise generator

<pre class="example">
rails generate devise:install
</pre>

<p>
This generates a set of further instructions
</p>

<pre class="example">
Some setup you must do manually if you haven't yet:
</pre>

<ul class="org-ul">
<li><code>[X]</code> Ensure you have defined default url options in your environments 
files. 

<p>
<a href="./config/environments/development.rb">./config/environments/development.rb</a>
</p>

<pre class="example">
config.action_mailer.default_url_options = { host: 'localhost:3000' }
</pre>
</li>

<li><code>[X]</code> In production, :host should be set to the actual host of your application.

<p>
<a href="./config/environments/production.rb">./config/environments/production.rb</a>
</p>

<pre class="example">
config.action_mailer.default_url_options = { host: 'gensched.herokuapp.com' }
</pre>
</li>

<li><code>[X]</code> Ensure you have defined root<sub>url</sub> to <b>something</b> 

<p>
<a href="./config/routes.rb">./config/routes.rb</a>
</p>

<pre class="example">
root 'pages#index'
</pre>

<p>
<a href="./app/views/pages/index.html.erb">./app/views/pages/index.html.erb</a>
</p>
</li>
</ul>
</li>
</ul>
</li>
</ul>


<ul class="org-ul">
<li><code>[X]</code> Ensure you have flash messages  

<p>
<a href="./app/views/layouts/application.html.erb">./app/views/layouts/application.html.erb</a>
</p>

<pre class="example">
&lt;p class="notice"&gt;&lt;%= notice %&gt;&lt;/p&gt;
&lt;p class="alert"&gt;&lt;%= alert %&gt;&lt;/p&gt;
</pre>
</li>

<li><code>[X]</code> Copy Devise views (for customization):

<pre class="example">
rails g devise:views
</pre>
</li>

<li><code>[X]</code> Add Devise to a model

<pre class="example">
rails g devise MODEL
</pre>

<pre class="example">
rails g devise User
</pre>
</li>

<li><code>[&#xa0;]</code> Configure the model
</li>

<li><code>[X]</code> Migrate the database

<pre class="example">
rake db:migrate
</pre>
</li>
</ul>
</li>



<li class="fragment none">Admin<br/><ul class="org-ul">
<li><code>[&#xa0;]</code> create a migration to add admin boolean to User model
</li>
</ul>
</li></ul>


</section>
<section id="sec-3-1-3" >

<h4>Shift</h4>
<ul class="org-ul">
<li><code>[X]</code> Generate Shift scaffold

<pre class="example">
rails g scaffold Shift index pickup:string dropoff:string
</pre>
</li>
</ul>

<ul class="org-ul"><li class="fragment none">table<br/><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">shift</th>
<th scope="col" class="right">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="right">id: integer</td>
<td class="left">pickup: string?</td>
<td class="left">dropoff: string?</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">example</td>
<td class="right">3</td>
<td class="left">Time.now.to<sub>f</sub>.to<sub>s</sub></td>
<td class="left">Time.at(Time.now+60).to<sub>f</sub>.to<sub>s</sub></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="right">7</td>
<td class="left">Time.at(60*30).to<sub>f</sub>.to<sub>s</sub></td>
<td class="left">Time.at(90000000).to<sub>f</sub>.to<sub>s</sub></td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li><code>[&#xa0;]</code> other attributes?
</li>

<li><code>[&#xa0;]</code> use .to<sub>f</sub> method to retain fractions of a second

<pre class="example">
Time.now =&gt; 2014-06-23 20:02:16 +0000 
Time.now.to_i =&gt; 1403553736
Time.now.to_f =&gt; 1403553736.279851
</pre>
</li>

<li><code>[&#xa0;]</code> convert time to float before string?

<p>
because the string can be converted back and Time.at(float)
will return an actual time that can be used, whereas it seems
that a string "2014-06-23 20:02:16 +0000" might not be convertable
back to a time?
</p>

<ul class="org-ul">
<li><code>[&#xa0;]</code> use the time module

<ul class="org-ul">
<li><code>[&#xa0;]</code> unsure if this is the appropriate place for it

<p>
<a href="./config/application.rb">./config/application.rb</a>
</p>
</li>
</ul>
<pre class="example">
require 'time'
</pre>

<p>
then
</p>

<pre class="example">
Time.parse('2014-06-23 20:02:16 +0000') =&gt; 2014-06-23 20:02:16 +0000 
</pre>
</li>
</ul>
</li>
</ul>
</li></ul>



</section>
<section id="sec-3-1-4" >

<h4>Commercial Exchange</h4>


</section>
<section id="sec-3-1-5" >

<h4>Rails Generation</h4>
<ul class="org-ul"><li class="fragment none">Scaffolding<br/><ul class="org-ul">
<li><code>[X]</code> Disable scaffold stylesheet creation 

<p>
<a href="./config/application.rb">./config/application.rb</a>
</p>

<pre class="example">
config.generators do |g|
  g.stylesheets false
end
</pre>
</li>

<li><code>[X]</code> Generate a scaffold

<p>
EXAMPLE
</p>
<pre class="example">
rails g scaffold Page index
</pre>
</li>

<li><code>[X]</code> migrate the database

<pre class="example">
rake db:migrate
</pre>
</li>
</ul>
</li>


<li class="fragment none">Generating a Model<br/></li></ul>


</section>
<section id="sec-3-1-6" >

<h4>Service</h4>
<p>
For now, I think it would make sense to look at it simply, accounting for a
single service that can be scheduled.
</p>


</section>
<section id="sec-3-2" >

<h3>View</h3>
</section>
<section id="sec-3-2-1" >

<h4>Skrollr</h4>
<ul class="org-ul">
<li><code>[&#xa0;]</code> add skrollr script
</li>

<li><code>[&#xa0;]</code> application.js
</li>
</ul>


</section>
<section id="sec-3-2-2" >

<h4>Bootstrap-sass</h4>
<ul class="org-ul">
<li><code>[X]</code> Create custom bootstrap stylesheet

<p>
<a href="./app/assets/stylesheets/bootstrap_and_customization.css.scss">./app/assets/stylesheets/bootstrap_and_customization.css.scss</a>
</p>

<pre class="example">
echo "@import 'bootsrap';" &gt; app/assets/stylesheets/bootstrap_and_customization.css.scss
</pre>

<p>
<b>NOTE</b> Place new variables before "@import 'bootstrap'"
</p>

<ul class="org-ul">
<li><code>[X]</code> Fonts

<p>
<i>EXAMPLE:</i>
</p>
<pre class="example">
@import url(http://fonts.googleapis.com/css?family=Roboto:400,100,100italic,700italic,700|Clicker+Script);
</pre>
</li>

<li><code>[X]</code> Variables

<pre class="example">
$phill-grn: #3f8000;
</pre>
</li>
</ul>
</li>

<li><code>[X]</code> Require Bootstrap's Javascript, after jquery<sub>ujs</sub> 

<p>
<a href="./app/assets/javascripts/application.js">./app/assets/javascripts/application.js</a>
</p>

<pre class="example">
//= require jquery
//= require jquery_ujs
//= require bootstrap
//= require turbolinks
//= require_tree .
</pre>
</li>
</ul>


</section>
<section id="sec-3-2-3" >

<h4>Assets</h4>
<ul class="org-ul"><li class="fragment none">Stylesheets<br/></li>

<li class="fragment none">Javascripts<br/><ul class="org-ul">
<li><code>[X]</code> Replace turbolinks with jquery-turbolinks

<p>
<i>app/assets/javascripts/application.js</i>
</p>

<pre class="example">
app/assets/javascripts/application.js
</pre>

<ul class="org-ul">
<li><code>[X]</code> remove turbolinks line

<pre class="example">
//= require turbolinks
</pre>
</li>

<li><code>[X]</code> add jquery.turbolinks under bootstrap

<pre class="example">
//= require bootstrap
//= require jquery.turbolinks
</pre>
</li>
</ul>
</li>
</ul>
</li>

<li class="fragment none">Images<br/><ul class="org-ul">
<li><code>[&#xa0;]</code> css background images 
</li>
</ul>
</li></ul>


</section>
<section id="sec-3-2-4" >

<h4>Views</h4>
<ul class="org-ul"><li class="fragment none">Application<br/><p>
<a href="./app/views/">./app/views/</a>
</p>

<ul class="org-ul">
<li><code>[X]</code> add viewport

<p>
<a href="./app/views/layouts/application.html.erb">./app/views/layouts/application.html.erb</a>
</p>

<pre class="example">
&lt;meta name="viewport" content="width=device-width, intial-scale=1.0"&gt;
</pre>
</li>
</ul>
</li>

<li class="fragment none">Pages<br/><p>
<a href="./app/views/pages/">./app/views/pages/</a>
</p>

<ul class="org-ul"><li class="fragment none">Home<br/><p>
<a href="./app/views/pages/home.html.erb">./app/views/pages/home.html.erb</a>
</p>
</li></ul>
</li>



<li class="fragment none">Layouts<br/></li>

<li class="fragment none">Partials<br/></li></ul>


</section>
<section id="sec-3-3" >

<h3>Control</h3>
</section>
<section id="sec-3-3-1" >

<h4>Routes</h4>
<p>
<a href="./app/views/">Views Directory</a>
</p>

<p>
<a href="./config/routes.rb">./config/routes.rb</a>
</p>

<ul class="org-ul">
<li><code>[X]</code> create root path

<pre class="example">
root 'pages#index'
</pre>
</li>
</ul>


</section>
<section id="sec-3-3-2" >

<h4>Controllers</h4>
<p>
<a href="./app/controllers/application_controller.rb">./app/controllers/application_controller.rb</a>
</p>

<p>
<a href="./app/controllers/pages_controller.rb">./app/controllers/pages_controller.rb</a>
</p>
</section>


</section>
<section>
<section id="sec-4" >

<h2>Other required services</h2>
</section>
<section id="sec-4-1" >

<h3>Set up a mailer</h3>


</section>
<section id="sec-4-2" >

<h3>commerce exchange</h3>
</section>

</section>
<section>
<section id="sec-5" >

<h2>Application skeleton BASICS</h2>
</section>
<section id="sec-5-1" >

<h3>Useful commands</h3>
</section>
<section id="sec-5-1-1" >

<h4>Rake</h4>
<pre class="example">
rake routes
</pre>


</section>
<section id="sec-5-1-2" >

<h4>Rails</h4>
<pre class="example">
rails console
</pre>

</section>
<section id="sec-5-2" >

<h3>Essential Files</h3>
<p>
<a href="./Gemfile">Gemfile</a>
</p>

</section>
<section id="sec-5-3" >

<h3>the following has now been defaulted into</h3>
<p>
DEV:edit <a href="./rails-new.sh">./rails-new.sh</a>
</p>

<p>
<a href="./rails-new">./rails-new</a>
</p>

</section>
<section id="sec-5-3-1" >

<h4>Create the default skeletal application</h4>
<ul class="org-ul">
<li><code>[X]</code> create scheduler application

<pre class="example">
rails new scheduler
</pre>
</li>

<li><code>[X]</code> update README

<pre class="example">
rm README.rdoc
touch README.org
</pre>
</li>

<li><code>[X]</code> copy generic rails script 

<p>
For documentation and testing purpose of developing my default rails new 
bash script
</p>

<pre class="example">
ln -s $HOME/bin/rails-new.sh rails-new.sh 
cp $HOME/bin/rails-new.sh rails-new 
</pre>
</li>
</ul>


<ul class="org-ul">
<li><code>[X]</code> rename application.css to application.css.scss

<pre class="example">
cd app/assets/stylesheets
mv application.css application.css.scss
</pre>
</li>

<li><code>[X]</code> Test the skeletal application

<ul class="org-ul">
<li><code>[X]</code> Start the Rails server
</li>
</ul>
<pre class="example">
rails s
</pre>

<ul class="org-ul">
<li><code>[X]</code> open your browser to localhost, port 3000

<pre class="example">
localhost:3000
</pre>
</li>
</ul>
</li>

<li><code>[X]</code> update the Gemfile

<pre class="example">
cat ~/RAILS-dev/DEFAULT-Gemfile &gt; Gemfile
</pre>
</li>

<li><code>[X]</code> update the bundle

<pre class="example">
bundle update
bundle install --without production
</pre>
</li>
</ul>

</section>
<section id="sec-5-3-2" >

<h4>Set up Git and Heroku</h4>
<ul class="org-ul"><li class="fragment none">Git<br/><ul class="org-ul">
<li><code>[X]</code> initialize git repo

<pre class="example">
git init
</pre>
</li>

<li><code>[X]</code> update .gitignore

<pre class="example">
echo ".env" &gt;&gt; .gitignore
echo "Procfile" &gt;&gt; .gitignore
</pre>
</li>

<li><code>[X]</code> initial stage and commit of all files

<pre class="example">
git add .
git commit -am "initial commit"
</pre>
</li>

<li><code>[X]</code> add the origin

<pre class="example">
git remote add origin https://github.com/son1112/scheduler.git
</pre>
</li>

<li><code>[X]</code> initial push

<pre class="example">
git push -u origin master
</pre>
</li>
</ul>
</li>

<li class="fragment none">Heroku<br/><ul class="org-ul">
<li><code>[X]</code> Create and push a new heroku app

<pre class="example">
heroku create
git push heroku master
</pre>
</li>

<li><code>[X]</code> Rename the heroku app

<pre class="example">
heroku rename gensched
</pre>
</li>
</ul>
</li></ul>
</section>
</section>
</div>
</div>

<script src="http://cdn.jsdelivr.net/reveal.js/2.5.0/lib/js/head.min.js"></script>
<script src="http://cdn.jsdelivr.net/reveal.js/2.5.0/js/reveal.min.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: true,
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'http://cdn.jsdelivr.net/reveal.js/2.5.0/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
]
});
</script>
</body>
</html>
